main_menu = "🌐 Головне меню"

class General:
	authors = "👨‍🎓 Автори"
	books = "📘 Книги"
	borrows = "📚 Борги"
	users = "👥 Користувачі"
	book_author = "🔗 Зв'язок автор & книга"
	genres = "🎭 Жанри"
	book_genre = "🔗 Зв'язок жанр & книга"
	combined = "🫁 Комбіновані"

class Authors:
	create_table = "🧮 Створити таблицю авторів"
	delete_table = "⚖️ Видалити таблицю авторів"
	add = "📌 Добавити автора"
	delete = "❌ Видалити автора"
	edit = "✏️ Відредагувати автора"
	get = "🔖 Знайти автора"
	get_all = "🔎 Отримати усіх авторів"

class BookAuthor:
	create_table = "🧮 Створити таблицю книга & автор"
	delete_table = "⚖️ Видалити таблицю книга & автор"
	add = "📌 Добавити зв'язок к&а"
	delete = "❌ Видалити зв'язок к&а"
	get_by_author = "🔖 Знайти по автору зв'язок к&а"
	get_by_book = "🔖 Знайти по книзі зв'язок к&а"
	get_all = "🔎 Отримати усі зв'язки к&а"

class BookGenre:
	create_table = "🧮 Створити таблицю книга & жанр"
	delete_table = "⚖️ Видалити таблицю книга & жанр"
	add = "📌 Добавити зв'язок к&ж"
	delete = "❌ Видалити зв'язок к&ж"
	get_by_genre = "🔖 Знайти по жанру зв'язок к&ж"
	get_by_book = "🔖 Знайти по книзі зв'язок к&ж"
	get_all = "🔎 Отримати усі зв'язки к&ж"

class Books:
	create_table = "🧮 Створити таблицю книг"
	delete_table = "⚖️ Видалити таблицю книг"
	add = "📌 Добавити книгу"
	delete = "❌ Видалити книгу"
	edit = "✏️ Відредагувати книгу"
	get = "🔖 Знайти книгу"
	get_all = "🔎 Отримати усі книги"
	book_by_author = "👨‍🎓 Книга по автору"
	book_by_name = "📃 Книга по назві"
	book_by_genre = "🎏 Книга по жанру"
	popular_books = "💎 Найпопулярніша книга"
	
class Borrows:
	create_table = "🧮 Створити таблицю боргів"
	delete_table = "⚖️ Видалити таблицю боргів"
	add = "📌 Добавити борг"
	delete = "❌ Видалити борг"
	edit = "✏️ Відредагувати борг"
	edit_returned = "🗳 Зареєструвати повернення"
	get = "🔖 Знайти борг"
	get_all = "🔎 Отримати усі борги"
	not_returned = "🛎 Книги в користувачів"
	overdue = "📌 Порушили термін"

class Genres:
	create_table = "🧮 Створити таблицю жанрів"
	delete_table = "⚖️ Видалити таблицю жанрів"
	add = "📌 Добавити жанр"
	delete = "❌ Видалити жанр"
	edit = "✏️ Відредагувати жанр"
	get = "🔖 Знайти жанр"
	get_all = "🔎 Отримати усі жанри"

class Users:
	create_table = "🧮 Створити таблицю користувачів"
	delete_table = "⚖️ Видалити таблицю користувачів"
	add = "📌 Добавити користувача"
	delete = "❌ Видалити користувача"
	edit = "✏️ Відредагувати користувача"
	get = "🔖 Знайти користувача"
	get_all = "🔎 Отримати усіх користувачів"

class Combined:
	book_by_author = "👨‍🎓 Книга по автору"
	book_by_name = "📃 Книга по назві"
	book_by_genre = "🎏 Книга по жанру"
	not_returned = "🛎 Книги в користувачів"
	overdue = "📌 Порушили термін"
	popular_books = "💎 Найпопулярніша книга"